Revit 2027 API
HVACZoneData Properties
The HVACZoneData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from GenericZoneDomainData)
ZoneEquipmentId |  The id of the zone equipment related to the zone.
Top
See Also
Reference
HVACZoneData Class
Autodesk.Revit.DB.Mechanical Namespace